app/controllers/categories_controller.rb

UPDATE "categories" SET "name" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["name", "Ruby1"], ["updated_at", "2017-12-06 13:30:16.077925"], ["id", 1]]
---
  def update
    if @category.update_attributes(category_params)