app/controllers/pictures_controller.rb

INSERT INTO "pictures" ("image", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["image", "#<ActionDispatch::Http::UploadedFile:0x00007f99334a8660>"], ["created_at", "2017-11-25 14:52:36.638959"], ["updated_at", "2017-11-25 14:52:36.638959"]]
---
  def create
    @picture = Picture.new(image_params)
    if @picture.save