app/controllers/posts_controller.rb

  def index
    @posts = Post.paginate(:page => params[:page], :per_page => 5)
---
SELECT  "posts".* FROM "posts" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"

  def create
    @post = Post.create(post_params)
---
INSERT INTO "posts" ("title", "summary", "body", "created_at", "updated_at", "image") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "123"], ["summary", "213"], ["body", "231"], ["created_at", "2017-11-25 11:13:17.335378"], ["updated_at", "2017-11-25 11:13:17.335378"], ["image", "foto.jpg"]]

  def update
    if @post.update_attributes(post_params)
---
UPDATE "posts" SET "title" = $1, "summary" = $2, "body" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["title", "title32"], ["summary", "summary32"], ["body", "body32"], ["updated_at", "2017-11-24 11:13:10.992508"], ["id", 3]]